---
kind: other
id: Properties.T:Autodesk.Revit.DB.IFC.IFCGeometryInfo
source: html/13751b36-d2e5-5ab1-f900-c91fc55010f8.htm
---
# IFCGeometryInfo Properties

Specifies whether the .NET object represents a valid Revit entity.